## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: terraform
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-   destroy

Terraform will perform the following actions:

  # kubernetes_annotations.cinema will be updated in-place
!   resource "kubernetes_annotations" "cinema" {
!       annotations = {
+           "mesh.cloud.google.com/proxy" = jsonencode(
                {
+                   managed = "true"
                }
            )
        }
        id          = "apiVersion=v1,kind=Namespace,name=cinema"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # kubernetes_manifest.istio-deployment will be destroyed
  # (because kubernetes_manifest.istio-deployment is not in configuration)
-   resource "kubernetes_manifest" "istio-deployment" {
-       manifest = {
-           apiVersion = "apps/v1"
-           kind       = "Deployment"
-           metadata   = {
-               name      = "istio-ingressgateway"
-               namespace = "istio-system"
            }
-           spec       = {
-               selector = {
-                   matchLabels = {
-                       app   = "istio-ingressgateway"
-                       istio = "ingressgateway"
                    }
                }
-               template = {
-                   metadata = {
-                       annotations = {
-                           "inject.istio.io/templates" = "gateway"
                        }
-                       labels      = {
-                           app   = "istio-ingressgateway"
-                           istio = "ingressgateway"
                        }
                    }
-                   spec     = {
-                       containers         = [
-                           {
-                               image     = "auto"
-                               name      = "istio-proxy"
-                               resources = {
-                                   limits   = {
-                                       cpu    = "2Gi"
-                                       memory = "1Gi"
                                    }
-                                   requests = {
-                                       cpu    = "100Mi"
-                                       memory = "128Mi"
                                    }
                                }
                            },
                        ]
-                       serviceAccountName = "istio-ingressgateway"
                    }
                }
            }
        } -> null
-       object   = {
-           apiVersion = "apps/v1"
-           kind       = "Deployment"
-           metadata   = {
-               annotations                = {
-                   "deployment.kubernetes.io/revision" = "1"
                }
-               clusterName                = null
-               creationTimestamp          = null
-               deletionGracePeriodSeconds = null
-               deletionTimestamp          = null
-               finalizers                 = null
-               generateName               = null
-               generation                 = null
-               labels                     = null
-               managedFields              = null
-               name                       = "istio-ingressgateway"
-               namespace                  = "istio-system"
-               ownerReferences            = null
-               resourceVersion            = null
-               selfLink                   = null
-               uid                        = null
            }
-           spec       = {
-               minReadySeconds         = null
-               paused                  = null
-               progressDeadlineSeconds = 600
-               replicas                = 2
-               revisionHistoryLimit    = 10
-               selector                = {
-                   matchExpressions = null
-                   matchLabels      = {
-                       "app"   = "istio-ingressgateway"
-                       "istio" = "ingressgateway"
                    }
                }
-               strategy                = {
-                   rollingUpdate = {
-                       maxSurge       = "25%"
-                       maxUnavailable = "25%"
                    }
-                   type          = "RollingUpdate"
                }
-               template                = {
-                   metadata = {
-                       annotations                = {
-                           "inject.istio.io/templates" = "gateway"
                        }
-                       clusterName                = null
-                       creationTimestamp          = null
-                       deletionGracePeriodSeconds = null
-                       deletionTimestamp          = null
-                       finalizers                 = null
-                       generateName               = null
-                       generation                 = null
-                       labels                     = {
-                           "app"   = "istio-ingressgateway"
-                           "istio" = "ingressgateway"
                        }
-                       managedFields              = null
-                       name                       = null
-                       namespace                  = null
-                       ownerReferences            = null
-                       resourceVersion            = null
-                       selfLink                   = null
-                       uid                        = null
                    }
-                   spec     = {
-                       activeDeadlineSeconds         = null
-                       affinity                      = {
-                           nodeAffinity    = {
-                               preferredDuringSchedulingIgnoredDuringExecution = null
-                               requiredDuringSchedulingIgnoredDuringExecution  = {
-                                   nodeSelectorTerms = null
                                }
                            }
-                           podAffinity     = {
-                               preferredDuringSchedulingIgnoredDuringExecution = null
-                               requiredDuringSchedulingIgnoredDuringExecution  = null
                            }
-                           podAntiAffinity = {
-                               preferredDuringSchedulingIgnoredDuringExecution = null
-                               requiredDuringSchedulingIgnoredDuringExecution  = null
                            }
                        }
-                       automountServiceAccountToken  = null
-                       containers                    = [
-                           {
-                               args                     = null
-                               command                  = null
-                               env                      = null
-                               envFrom                  = null
-                               image                    = "auto"
-                               imagePullPolicy          = "Always"
-                               lifecycle                = {
-                                   postStart = {
-                                       exec      = {
-                                           command = null
                                        }
-                                       httpGet   = {
-                                           host        = null
-                                           httpHeaders = null
-                                           path        = null
-                                           port        = null
-                                           scheme      = null
                                        }
-                                       tcpSocket = {
-                                           host = null
-                                           port = null
                                        }
                                    }
-                                   preStop   = {
-                                       exec      = {
-                                           command = null
                                        }
-                                       httpGet   = {
-                                           host        = null
-                                           httpHeaders = null
-                                           path        = null
-                                           port        = null
-                                           scheme      = null
                                        }
-                                       tcpSocket = {
-                                           host = null
-                                           port = null
                                        }
                                    }
                                }
-                               livenessProbe            = {
-                                   exec                          = {
-                                       command = null
                                    }
-                                   failureThreshold              = null
-                                   grpc                          = {
-                                       port    = null
-                                       service = null
                                    }
-                                   httpGet                       = {
-                                       host        = null
-                                       httpHeaders = null
-                                       path        = null
-                                       port        = null
-                                       scheme      = null
                                    }
-                                   initialDelaySeconds           = null
-                                   periodSeconds                 = null
-                                   successThreshold              = null
-                                   tcpSocket                     = {
-                                       host = null
-                                       port = null
                                    }
-                                   terminationGracePeriodSeconds = null
-                                   timeoutSeconds                = null
                                }
-                               name                     = "istio-proxy"
-                               ports                    = null
-                               readinessProbe           = {
-                                   exec                          = {
-                                       command = null
                                    }
-                                   failureThreshold              = null
-                                   grpc                          = {
-                                       port    = null
-                                       service = null
                                    }
-                                   httpGet                       = {
-                                       host        = null
-                                       httpHeaders = null
-                                       path        = null
-                                       port        = null
-                                       scheme      = null
                                    }
-                                   initialDelaySeconds           = null
-                                   periodSeconds                 = null
-                                   successThreshold              = null
-                                   tcpSocket                     = {
-                                       host = null
-                                       port = null
                                    }
-                                   terminationGracePeriodSeconds = null
-                                   timeoutSeconds                = null
                                }
-                               resources                = {
-                                   limits   = {
-                                       "cpu"    = "2Gi"
-                                       "memory" = "1Gi"
                                    }
-                                   requests = {
-                                       "cpu"    = "100Mi"
-                                       "memory" = "128Mi"
                                    }
                                }
-                               securityContext          = {
-                                   allowPrivilegeEscalation = null
-                                   capabilities             = {
-                                       add  = null
-                                       drop = null
                                    }
-                                   privileged               = null
-                                   procMount                = null
-                                   readOnlyRootFilesystem   = null
-                                   runAsGroup               = null
-                                   runAsNonRoot             = null
-                                   runAsUser                = null
-                                   seLinuxOptions           = {
-                                       level = null
-                                       role  = null
-                                       type  = null
-                                       user  = null
                                    }
-                                   seccompProfile           = {
-                                       localhostProfile = null
-                                       type             = null
                                    }
-                                   windowsOptions           = {
-                                       gmsaCredentialSpec     = null
-                                       gmsaCredentialSpecName = null
-                                       hostProcess            = null
-                                       runAsUserName          = null
                                    }
                                }
-                               startupProbe             = {
-                                   exec                          = {
-                                       command = null
                                    }
-                                   failureThreshold              = null
-                                   grpc                          = {
-                                       port    = null
-                                       service = null
                                    }
-                                   httpGet                       = {
-                                       host        = null
-                                       httpHeaders = null
-                                       path        = null
-                                       port        = null
-                                       scheme      = null
                                    }
-                                   initialDelaySeconds           = null
-                                   periodSeconds                 = null
-                                   successThreshold              = null
-                                   tcpSocket                     = {
-                                       host = null
-                                       port = null
                                    }
-                                   terminationGracePeriodSeconds = null
-                                   timeoutSeconds                = null
                                }
-                               stdin                    = null
-                               stdinOnce                = null
-                               terminationMessagePath   = "/dev/termination-log"
-                               terminationMessagePolicy = "File"
-                               tty                      = null
-                               volumeDevices            = null
-                               volumeMounts             = null
-                               workingDir               = null
                            },
                        ]
-                       dnsConfig                     = {
-                           nameservers = null
-                           options     = null
-                           searches    = null
                        }
-                       dnsPolicy                     = "ClusterFirst"
-                       enableServiceLinks            = null
-                       ephemeralContainers           = null
-                       hostAliases                   = null
-                       hostIPC                       = null
-                       hostNetwork                   = null
-                       hostPID                       = null
-                       hostname                      = null
-                       imagePullSecrets              = null
-                       initContainers                = null
-                       nodeName                      = null
-                       nodeSelector                  = null
-                       os                            = {
-                           name = null
                        }
-                       overhead                      = null
-                       preemptionPolicy              = null
-                       priority                      = null
-                       priorityClassName             = null
-                       readinessGates                = null
-                       restartPolicy                 = "Always"
-                       runtimeClassName              = null
-                       schedulerName                 = "default-scheduler"
-                       securityContext               = {
-                           fsGroup             = null
-                           fsGroupChangePolicy = null
-                           runAsGroup          = null
-                           runAsNonRoot        = null
-                           runAsUser           = null
-                           seLinuxOptions      = {
-                               level = null
-                               role  = null
-                               type  = null
-                               user  = null
                            }
-                           seccompProfile      = {
-                               localhostProfile = null
-                               type             = null
                            }
-                           supplementalGroups  = null
-                           sysctls             = null
-                           windowsOptions      = {
-                               gmsaCredentialSpec     = null
-                               gmsaCredentialSpecName = null
-                               hostProcess            = null
-                               runAsUserName          = null
                            }
                        }
-                       serviceAccount                = "istio-ingressgateway"
-                       serviceAccountName            = "istio-ingressgateway"
-                       setHostnameAsFQDN             = null
-                       shareProcessNamespace         = null
-                       subdomain                     = null
-                       terminationGracePeriodSeconds = 30
-                       tolerations                   = null
-                       topologySpreadConstraints     = null
-                       volumes                       = null
                    }
                }
            }
        } -> null
    }

  # kubernetes_manifest.istio-hpa will be destroyed
  # (because kubernetes_manifest.istio-hpa is not in configuration)
-   resource "kubernetes_manifest" "istio-hpa" {
-       manifest = {
-           apiVersion = "autoscaling/v2beta1"
-           kind       = "HorizontalPodAutoscaler"
-           metadata   = {
-               name      = "istio-ingressgateway"
-               namespace = "istio-system"
            }
-           spec       = {
-               maxReplicas    = 5
-               metrics        = [
-                   {
-                       resource = {
-                           name                     = "cpu"
-                           targetAverageUtilization = 80
                        }
-                       type     = "Resource"
                    },
                ]
-               minReplicas    = 2
-               scaleTargetRef = {
-                   apiVersion = "apps/v1"
-                   kind       = "Deployment"
-                   name       = "istio-ingressgateway"
                }
            }
        } -> null
-       object   = {
-           apiVersion = "autoscaling/v2beta1"
-           kind       = "HorizontalPodAutoscaler"
-           metadata   = {
-               annotations                = null
-               clusterName                = null
-               creationTimestamp          = null
-               deletionGracePeriodSeconds = null
-               deletionTimestamp          = null
-               finalizers                 = null
-               generateName               = null
-               generation                 = null
-               labels                     = null
-               managedFields              = null
-               name                       = "istio-ingressgateway"
-               namespace                  = "istio-system"
-               ownerReferences            = null
-               resourceVersion            = null
-               selfLink                   = null
-               uid                        = null
            }
-           spec       = {
-               maxReplicas    = 5
-               metrics        = [
-                   {
-                       containerResource = {
-                           container                = null
-                           name                     = null
-                           targetAverageUtilization = null
-                           targetAverageValue       = null
                        }
-                       external          = {
-                           metricName         = null
-                           metricSelector     = {
-                               matchExpressions = null
-                               matchLabels      = null
                            }
-                           targetAverageValue = null
-                           targetValue        = null
                        }
-                       object            = {
-                           averageValue = null
-                           metricName   = null
-                           selector     = {
-                               matchExpressions = null
-                               matchLabels      = null
                            }
-                           target       = {
-                               apiVersion = null
-                               kind       = null
-                               name       = null
                            }
-                           targetValue  = null
                        }
-                       pods              = {
-                           metricName         = null
-                           selector           = {
-                               matchExpressions = null
-                               matchLabels      = null
                            }
-                           targetAverageValue = null
                        }
-                       resource          = {
-                           name                     = "cpu"
-                           targetAverageUtilization = 80
-                           targetAverageValue       = null
                        }
-                       type              = "Resource"
                    },
                ]
-               minReplicas    = 2
-               scaleTargetRef = {
-                   apiVersion = "apps/v1"
-                   kind       = "Deployment"
-                   name       = "istio-ingressgateway"
                }
            }
        } -> null
    }

  # kubernetes_manifest.istio-rbac-role will be destroyed
  # (because kubernetes_manifest.istio-rbac-role is not in configuration)
-   resource "kubernetes_manifest" "istio-rbac-role" {
-       manifest = {
-           apiVersion = "rbac.authorization.k8s.io/v1"
-           kind       = "Role"
-           metadata   = {
-               name      = "istio-ingressgateway"
-               namespace = "istio-system"
            }
-           rules      = [
-               {
-                   apiGroups = [
-                       "",
                    ]
-                   resources = [
-                       "secrets",
                    ]
-                   verbs     = [
-                       "get",
-                       "watch",
-                       "list",
                    ]
                },
            ]
        } -> null
-       object   = {
-           apiVersion = "rbac.authorization.k8s.io/v1"
-           kind       = "Role"
-           metadata   = {
-               annotations                = null
-               clusterName                = null
-               creationTimestamp          = null
-               deletionGracePeriodSeconds = null
-               deletionTimestamp          = null
-               finalizers                 = null
-               generateName               = null
-               generation                 = null
-               labels                     = null
-               managedFields              = null
-               name                       = "istio-ingressgateway"
-               namespace                  = "istio-system"
-               ownerReferences            = null
-               resourceVersion            = null
-               selfLink                   = null
-               uid                        = null
            }
-           rules      = [
-               {
-                   apiGroups       = [
-                       "",
                    ]
-                   nonResourceURLs = null
-                   resourceNames   = null
-                   resources       = [
-                       "secrets",
                    ]
-                   verbs           = [
-                       "get",
-                       "watch",
-                       "list",
                    ]
                },
            ]
        } -> null
    }

  # kubernetes_manifest.istio-rbac-rolebinding will be destroyed
  # (because kubernetes_manifest.istio-rbac-rolebinding is not in configuration)
-   resource "kubernetes_manifest" "istio-rbac-rolebinding" {
-       manifest = {
-           apiVersion = "rbac.authorization.k8s.io/v1"
-           kind       = "RoleBinding"
-           metadata   = {
-               name      = "istio-ingressgateway"
-               namespace = "istio-system"
            }
-           roleRef    = {
-               apiGroup = "rbac.authorization.k8s.io"
-               kind     = "Role"
-               name     = "istio-ingressgateway-sds"
            }
-           subjects   = [
-               {
-                   kind = "ServiceAccount"
-                   name = "istio-ingressgateway-service-account"
                },
            ]
        } -> null
-       object   = {
-           apiVersion = "rbac.authorization.k8s.io/v1"
-           kind       = "RoleBinding"
-           metadata   = {
-               annotations                = null
-               clusterName                = null
-               creationTimestamp          = null
-               deletionGracePeriodSeconds = null
-               deletionTimestamp          = null
-               finalizers                 = null
-               generateName               = null
-               generation                 = null
-               labels                     = null
-               managedFields              = null
-               name                       = "istio-ingressgateway"
-               namespace                  = "istio-system"
-               ownerReferences            = null
-               resourceVersion            = null
-               selfLink                   = null
-               uid                        = null
            }
-           roleRef    = {
-               apiGroup = "rbac.authorization.k8s.io"
-               kind     = "Role"
-               name     = "istio-ingressgateway-sds"
            }
-           subjects   = [
-               {
-                   apiGroup  = null
-                   kind      = "ServiceAccount"
-                   name      = "istio-ingressgateway-service-account"
-                   namespace = null
                },
            ]
        } -> null
    }

  # kubernetes_manifest.istio-service will be destroyed
  # (because kubernetes_manifest.istio-service is not in configuration)
-   resource "kubernetes_manifest" "istio-service" {
-       manifest = {
-           apiVersion = "v1"
-           kind       = "Service"
-           metadata   = {
-               labels    = {
-                   app   = "istio-ingressgateway"
-                   istio = "ingressgateway"
                }
-               name      = "istio-ingressgateway"
-               namespace = "istio-system"
            }
-           spec       = {
-               ports    = [
-                   {
-                       name       = "status-port"
-                       port       = 15021
-                       protocol   = "TCP"
-                       targetPort = 15021
                    },
-                   {
-                       name = "http2"
-                       port = 80
                    },
-                   {
-                       name = "https"
-                       port = 443
                    },
                ]
-               selector = {
-                   app   = "istio-ingressgateway"
-                   istio = "ingressgateway"
                }
-               type     = "LoadBalancer"
            }
        } -> null
-       object   = {
-           apiVersion = "v1"
-           kind       = "Service"
-           metadata   = {
-               annotations                = {
-                   "cloud.google.com/neg" = jsonencode(
                        {
-                           ingress = true
                        }
                    )
                }
-               clusterName                = null
-               creationTimestamp          = null
-               deletionGracePeriodSeconds = null
-               deletionTimestamp          = null
-               finalizers                 = [
-                   "service.kubernetes.io/load-balancer-cleanup",
                ]
-               generateName               = null
-               generation                 = null
-               labels                     = {
-                   "app"   = "istio-ingressgateway"
-                   "istio" = "ingressgateway"
                }
-               managedFields              = null
-               name                       = "istio-ingressgateway"
-               namespace                  = "istio-system"
-               ownerReferences            = null
-               resourceVersion            = null
-               selfLink                   = null
-               uid                        = null
            }
-           spec       = {
-               allocateLoadBalancerNodePorts = true
-               clusterIP                     = "10.8.232.141"
-               clusterIPs                    = [
-                   "10.8.232.141",
                ]
-               externalIPs                   = null
-               externalName                  = null
-               externalTrafficPolicy         = "Cluster"
-               healthCheckNodePort           = null
-               internalTrafficPolicy         = "Cluster"
-               ipFamilies                    = [
-                   "IPv4",
                ]
-               ipFamilyPolicy                = "SingleStack"
-               loadBalancerClass             = null
-               loadBalancerIP                = null
-               loadBalancerSourceRanges      = null
-               ports                         = [
-                   {
-                       appProtocol = null
-                       name        = "status-port"
-                       nodePort    = 31172
-                       port        = 15021
-                       protocol    = "TCP"
-                       targetPort  = "15021"
                    },
-                   {
-                       appProtocol = null
-                       name        = "http2"
-                       nodePort    = 30392
-                       port        = 80
-                       protocol    = "TCP"
-                       targetPort  = "80"
                    },
-                   {
-                       appProtocol = null
-                       name        = "https"
-                       nodePort    = 31870
-                       port        = 443
-                       protocol    = "TCP"
-                       targetPort  = "443"
                    },
                ]
-               publishNotReadyAddresses      = null
-               selector                      = {
-                   "app"   = "istio-ingressgateway"
-                   "istio" = "ingressgateway"
                }
-               sessionAffinity               = "None"
-               sessionAffinityConfig         = {
-                   clientIP = {
-                       timeoutSeconds = null
                    }
                }
-               type                          = "LoadBalancer"
            }
        } -> null
    }

  # kubernetes_manifest.istio-serviceaccount will be destroyed
  # (because kubernetes_manifest.istio-serviceaccount is not in configuration)
-   resource "kubernetes_manifest" "istio-serviceaccount" {
-       manifest = {
-           apiVersion = "v1"
-           kind       = "ServiceAccount"
-           metadata   = {
-               name      = "istio-ingressgateway"
-               namespace = "istio-system"
            }
        } -> null
-       object   = {
-           apiVersion                   = "v1"
-           automountServiceAccountToken = null
-           imagePullSecrets             = null
-           kind                         = "ServiceAccount"
-           metadata                     = {
-               annotations                = null
-               clusterName                = null
-               creationTimestamp          = null
-               deletionGracePeriodSeconds = null
-               deletionTimestamp          = null
-               finalizers                 = null
-               generateName               = null
-               generation                 = null
-               labels                     = null
-               managedFields              = null
-               name                       = "istio-ingressgateway"
-               namespace                  = "istio-system"
-               ownerReferences            = null
-               resourceVersion            = null
-               selfLink                   = null
-               uid                        = null
            }
-           secrets                      = null
        } -> null
    }

  # kubernetes_manifest.istioegress-deployment will be created
+   resource "kubernetes_manifest" "istioegress-deployment" {
+       manifest = {
+           apiVersion = "apps/v1"
+           kind       = "Deployment"
+           metadata   = {
+               name      = "istio-egressgateway"
+               namespace = "istio-system"
            }
+           spec       = {
+               selector = {
+                   matchLabels = {
+                       app   = "istio-egressgateway"
+                       istio = "egressgateway"
                    }
                }
+               template = {
+                   metadata = {
+                       annotations = {
+                           "inject.istio.io/templates" = "gateway"
                        }
+                       labels      = {
+                           app   = "istio-egressgateway"
+                           istio = "egressgateway"
                        }
                    }
+                   spec     = {
+                       containers         = [
+                           {
+                               image     = "auto"
+                               name      = "istio-proxy"
+                               resources = {
+                                   limits   = {
+                                       cpu    = "2Gi"
+                                       memory = "1Gi"
                                    }
+                                   requests = {
+                                       cpu    = "100Mi"
+                                       memory = "128Mi"
                                    }
                                }
                            },
                        ]
+                       serviceAccountName = "istio-egressgateway"
                    }
                }
            }
        }
+       object   = {
+           apiVersion = "apps/v1"
+           kind       = "Deployment"
+           metadata   = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "istio-egressgateway"
+               namespace                  = "istio-system"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           spec       = {
+               minReadySeconds         = (known after apply)
+               paused                  = (known after apply)
+               progressDeadlineSeconds = (known after apply)
+               replicas                = (known after apply)
+               revisionHistoryLimit    = (known after apply)
+               selector                = {
+                   matchExpressions = (known after apply)
+                   matchLabels      = {
+                       "app"   = "istio-egressgateway"
+                       "istio" = "egressgateway"
                    }
                }
+               strategy                = {
+                   rollingUpdate = {
+                       maxSurge       = (known after apply)
+                       maxUnavailable = (known after apply)
                    }
+                   type          = (known after apply)
                }
+               template                = {
+                   metadata = {
+                       annotations                = {
+                           "inject.istio.io/templates" = "gateway"
                        }
+                       clusterName                = (known after apply)
+                       creationTimestamp          = (known after apply)
+                       deletionGracePeriodSeconds = (known after apply)
+                       deletionTimestamp          = (known after apply)
+                       finalizers                 = (known after apply)
+                       generateName               = (known after apply)
+                       generation                 = (known after apply)
+                       labels                     = {
+                           "app"   = "istio-egressgateway"
+                           "istio" = "egressgateway"
                        }
+                       managedFields              = (known after apply)
+                       name                       = (known after apply)
+                       namespace                  = (known after apply)
+                       ownerReferences            = (known after apply)
+                       resourceVersion            = (known after apply)
+                       selfLink                   = (known after apply)
+                       uid                        = (known after apply)
                    }
+                   spec     = {
+                       activeDeadlineSeconds         = (known after apply)
+                       affinity                      = {
+                           nodeAffinity    = {
+                               preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
+                               requiredDuringSchedulingIgnoredDuringExecution  = {
+                                   nodeSelectorTerms = (known after apply)
                                }
                            }
+                           podAffinity     = {
+                               preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
+                               requiredDuringSchedulingIgnoredDuringExecution  = (known after apply)
                            }
+                           podAntiAffinity = {
+                               preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
+                               requiredDuringSchedulingIgnoredDuringExecution  = (known after apply)
                            }
                        }
+                       automountServiceAccountToken  = (known after apply)
+                       containers                    = [
+                           {
+                               args                     = (known after apply)
+                               command                  = (known after apply)
+                               env                      = (known after apply)
+                               envFrom                  = (known after apply)
+                               image                    = "auto"
+                               imagePullPolicy          = (known after apply)
+                               lifecycle                = {
+                                   postStart = {
+                                       exec      = {
+                                           command = (known after apply)
                                        }
+                                       httpGet   = {
+                                           host        = (known after apply)
+                                           httpHeaders = (known after apply)
+                                           path        = (known after apply)
+                                           port        = (known after apply)
+                                           scheme      = (known after apply)
                                        }
+                                       tcpSocket = {
+                                           host = (known after apply)
+                                           port = (known after apply)
                                        }
                                    }
+                                   preStop   = {
+                                       exec      = {
+                                           command = (known after apply)
                                        }
+                                       httpGet   = {
+                                           host        = (known after apply)
+                                           httpHeaders = (known after apply)
+                                           path        = (known after apply)
+                                           port        = (known after apply)
+                                           scheme      = (known after apply)
                                        }
+                                       tcpSocket = {
+                                           host = (known after apply)
+                                           port = (known after apply)
                                        }
                                    }
                                }
+                               livenessProbe            = {
+                                   exec                          = {
+                                       command = (known after apply)
                                    }
+                                   failureThreshold              = (known after apply)
+                                   grpc                          = {
+                                       port    = (known after apply)
+                                       service = (known after apply)
                                    }
+                                   httpGet                       = {
+                                       host        = (known after apply)
+                                       httpHeaders = (known after apply)
+                                       path        = (known after apply)
+                                       port        = (known after apply)
+                                       scheme      = (known after apply)
                                    }
+                                   initialDelaySeconds           = (known after apply)
+                                   periodSeconds                 = (known after apply)
+                                   successThreshold              = (known after apply)
+                                   tcpSocket                     = {
+                                       host = (known after apply)
+                                       port = (known after apply)
                                    }
+                                   terminationGracePeriodSeconds = (known after apply)
+                                   timeoutSeconds                = (known after apply)
                                }
+                               name                     = "istio-proxy"
+                               ports                    = (known after apply)
+                               readinessProbe           = {
+                                   exec                          = {
+                                       command = (known after apply)
                                    }
+                                   failureThreshold              = (known after apply)
+                                   grpc                          = {
+                                       port    = (known after apply)
+                                       service = (known after apply)
                                    }
+                                   httpGet                       = {
+                                       host        = (known after apply)
+                                       httpHeaders = (known after apply)
+                                       path        = (known after apply)
+                                       port        = (known after apply)
+                                       scheme      = (known after apply)
                                    }
+                                   initialDelaySeconds           = (known after apply)
+                                   periodSeconds                 = (known after apply)
+                                   successThreshold              = (known after apply)
+                                   tcpSocket                     = {
+                                       host = (known after apply)
+                                       port = (known after apply)
                                    }
+                                   terminationGracePeriodSeconds = (known after apply)
+                                   timeoutSeconds                = (known after apply)
                                }
+                               resources                = {
+                                   limits   = {
+                                       "cpu"    = "2Gi"
+                                       "memory" = "1Gi"
                                    }
+                                   requests = {
+                                       "cpu"    = "100Mi"
+                                       "memory" = "128Mi"
                                    }
                                }
+                               securityContext          = {
+                                   allowPrivilegeEscalation = (known after apply)
+                                   capabilities             = {
+                                       add  = (known after apply)
+                                       drop = (known after apply)
                                    }
+                                   privileged               = (known after apply)
+                                   procMount                = (known after apply)
+                                   readOnlyRootFilesystem   = (known after apply)
+                                   runAsGroup               = (known after apply)
+                                   runAsNonRoot             = (known after apply)
+                                   runAsUser                = (known after apply)
+                                   seLinuxOptions           = {
+                                       level = (known after apply)
+                                       role  = (known after apply)
+                                       type  = (known after apply)
+                                       user  = (known after apply)
                                    }
+                                   seccompProfile           = {
+                                       localhostProfile = (known after apply)
+                                       type             = (known after apply)
                                    }
+                                   windowsOptions           = {
+                                       gmsaCredentialSpec     = (known after apply)
+                                       gmsaCredentialSpecName = (known after apply)
+                                       hostProcess            = (known after apply)
+                                       runAsUserName          = (known after apply)
                                    }
                                }
+                               startupProbe             = {
+                                   exec                          = {
+                                       command = (known after apply)
                                    }
+                                   failureThreshold              = (known after apply)
+                                   grpc                          = {
+                                       port    = (known after apply)
+                                       service = (known after apply)
                                    }
+                                   httpGet                       = {
+                                       host        = (known after apply)
+                                       httpHeaders = (known after apply)
+                                       path        = (known after apply)
+                                       port        = (known after apply)
+                                       scheme      = (known after apply)
                                    }
+                                   initialDelaySeconds           = (known after apply)
+                                   periodSeconds                 = (known after apply)
+                                   successThreshold              = (known after apply)
+                                   tcpSocket                     = {
+                                       host = (known after apply)
+                                       port = (known after apply)
                                    }
+                                   terminationGracePeriodSeconds = (known after apply)
+                                   timeoutSeconds                = (known after apply)
                                }
+                               stdin                    = (known after apply)
+                               stdinOnce                = (known after apply)
+                               terminationMessagePath   = (known after apply)
+                               terminationMessagePolicy = (known after apply)
+                               tty                      = (known after apply)
+                               volumeDevices            = (known after apply)
+                               volumeMounts             = (known after apply)
+                               workingDir               = (known after apply)
                            },
                        ]
+                       dnsConfig                     = {
+                           nameservers = (known after apply)
+                           options     = (known after apply)
+                           searches    = (known after apply)
                        }
+                       dnsPolicy                     = (known after apply)
+                       enableServiceLinks            = (known after apply)
+                       ephemeralContainers           = (known after apply)
+                       hostAliases                   = (known after apply)
+                       hostIPC                       = (known after apply)
+                       hostNetwork                   = (known after apply)
+                       hostPID                       = (known after apply)
+                       hostname                      = (known after apply)
+                       imagePullSecrets              = (known after apply)
+                       initContainers                = (known after apply)
+                       nodeName                      = (known after apply)
+                       nodeSelector                  = (known after apply)
+                       os                            = {
+                           name = (known after apply)
                        }
+                       overhead                      = (known after apply)
+                       preemptionPolicy              = (known after apply)
+                       priority                      = (known after apply)
+                       priorityClassName             = (known after apply)
+                       readinessGates                = (known after apply)
+                       restartPolicy                 = (known after apply)
+                       runtimeClassName              = (known after apply)
+                       schedulerName                 = (known after apply)
+                       securityContext               = {
+                           fsGroup             = (known after apply)
+                           fsGroupChangePolicy = (known after apply)
+                           runAsGroup          = (known after apply)
+                           runAsNonRoot        = (known after apply)
+                           runAsUser           = (known after apply)
+                           seLinuxOptions      = {
+                               level = (known after apply)
+                               role  = (known after apply)
+                               type  = (known after apply)
+                               user  = (known after apply)
                            }
+                           seccompProfile      = {
+                               localhostProfile = (known after apply)
+                               type             = (known after apply)
                            }
+                           supplementalGroups  = (known after apply)
+                           sysctls             = (known after apply)
+                           windowsOptions      = {
+                               gmsaCredentialSpec     = (known after apply)
+                               gmsaCredentialSpecName = (known after apply)
+                               hostProcess            = (known after apply)
+                               runAsUserName          = (known after apply)
                            }
                        }
+                       serviceAccount                = (known after apply)
+                       serviceAccountName            = "istio-egressgateway"
+                       setHostnameAsFQDN             = (known after apply)
+                       shareProcessNamespace         = (known after apply)
+                       subdomain                     = (known after apply)
+                       terminationGracePeriodSeconds = (known after apply)
+                       tolerations                   = (known after apply)
+                       topologySpreadConstraints     = (known after apply)
+                       volumes                       = (known after apply)
                    }
                }
            }
        }
    }

  # kubernetes_manifest.istioegress-hpa will be created
+   resource "kubernetes_manifest" "istioegress-hpa" {
+       manifest = {
+           apiVersion = "autoscaling/v2beta1"
+           kind       = "HorizontalPodAutoscaler"
+           metadata   = {
+               name      = "istio-egressgateway"
+               namespace = "istio-system"
            }
+           spec       = {
+               maxReplicas    = 5
+               metrics        = [
+                   {
+                       resource = {
+                           name                     = "cpu"
+                           targetAverageUtilization = 80
                        }
+                       type     = "Resource"
                    },
                ]
+               minReplicas    = 2
+               scaleTargetRef = {
+                   apiVersion = "apps/v1"
+                   kind       = "Deployment"
+                   name       = "istio-egressgateway"
                }
            }
        }
+       object   = {
+           apiVersion = "autoscaling/v2beta1"
+           kind       = "HorizontalPodAutoscaler"
+           metadata   = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "istio-egressgateway"
+               namespace                  = "istio-system"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           spec       = {
+               maxReplicas    = 5
+               metrics        = [
+                   {
+                       containerResource = {
+                           container                = (known after apply)
+                           name                     = (known after apply)
+                           targetAverageUtilization = (known after apply)
+                           targetAverageValue       = (known after apply)
                        }
+                       external          = {
+                           metricName         = (known after apply)
+                           metricSelector     = {
+                               matchExpressions = (known after apply)
+                               matchLabels      = (known after apply)
                            }
+                           targetAverageValue = (known after apply)
+                           targetValue        = (known after apply)
                        }
+                       object            = {
+                           averageValue = (known after apply)
+                           metricName   = (known after apply)
+                           selector     = {
+                               matchExpressions = (known after apply)
+                               matchLabels      = (known after apply)
                            }
+                           target       = {
+                               apiVersion = (known after apply)
+                               kind       = (known after apply)
+                               name       = (known after apply)
                            }
+                           targetValue  = (known after apply)
                        }
+                       pods              = {
+                           metricName         = (known after apply)
+                           selector           = {
+                               matchExpressions = (known after apply)
+                               matchLabels      = (known after apply)
                            }
+                           targetAverageValue = (known after apply)
                        }
+                       resource          = {
+                           name                     = "cpu"
+                           targetAverageUtilization = 80
+                           targetAverageValue       = (known after apply)
                        }
+                       type              = "Resource"
                    },
                ]
+               minReplicas    = 2
+               scaleTargetRef = {
+                   apiVersion = "apps/v1"
+                   kind       = "Deployment"
+                   name       = "istio-egressgateway"
                }
            }
        }
    }

  # kubernetes_manifest.istioegress-rbac-role will be created
+   resource "kubernetes_manifest" "istioegress-rbac-role" {
+       manifest = {
+           apiVersion = "rbac.authorization.k8s.io/v1"
+           kind       = "Role"
+           metadata   = {
+               name      = "istio-egressgateway"
+               namespace = "istio-system"
            }
+           rules      = [
+               {
+                   apiGroups = [
+                       "",
                    ]
+                   resources = [
+                       "secrets",
                    ]
+                   verbs     = [
+                       "get",
+                       "watch",
+                       "list",
                    ]
                },
            ]
        }
+       object   = {
+           apiVersion = "rbac.authorization.k8s.io/v1"
+           kind       = "Role"
+           metadata   = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "istio-egressgateway"
+               namespace                  = "istio-system"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           rules      = [
+               {
+                   apiGroups       = [
+                       "",
                    ]
+                   nonResourceURLs = (known after apply)
+                   resourceNames   = (known after apply)
+                   resources       = [
+                       "secrets",
                    ]
+                   verbs           = [
+                       "get",
+                       "watch",
+                       "list",
                    ]
                },
            ]
        }
    }

  # kubernetes_manifest.istioegress-rbac-rolebinding will be created
+   resource "kubernetes_manifest" "istioegress-rbac-rolebinding" {
+       manifest = {
+           apiVersion = "rbac.authorization.k8s.io/v1"
+           kind       = "RoleBinding"
+           metadata   = {
+               name      = "istio-egressgateway"
+               namespace = "istio-system"
            }
+           roleRef    = {
+               apiGroup = "rbac.authorization.k8s.io"
+               kind     = "Role"
+               name     = "istio-egressgateway-sds"
            }
+           subjects   = [
+               {
+                   kind = "ServiceAccount"
+                   name = "istio-egressgateway-service-account"
                },
            ]
        }
+       object   = {
+           apiVersion = "rbac.authorization.k8s.io/v1"
+           kind       = "RoleBinding"
+           metadata   = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "istio-egressgateway"
+               namespace                  = "istio-system"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           roleRef    = {
+               apiGroup = "rbac.authorization.k8s.io"
+               kind     = "Role"
+               name     = "istio-egressgateway-sds"
            }
+           subjects   = [
+               {
+                   apiGroup  = (known after apply)
+                   kind      = "ServiceAccount"
+                   name      = "istio-egressgateway-service-account"
+                   namespace = (known after apply)
                },
            ]
        }
    }

  # kubernetes_manifest.istioegress-service will be created
+   resource "kubernetes_manifest" "istioegress-service" {
+       manifest = {
+           apiVersion = "v1"
+           kind       = "Service"
+           metadata   = {
+               labels    = {
+                   app   = "istio-egressgateway"
+                   istio = "egressgateway"
                }
+               name      = "istio-egressgateway"
+               namespace = "istio-system"
            }
+           spec       = {
+               ports    = [
+                   {
+                       name       = "status-port"
+                       port       = 15021
+                       protocol   = "TCP"
+                       targetPort = 15021
                    },
+                   {
+                       name = "http2"
+                       port = 80
                    },
+                   {
+                       name = "https"
+                       port = 443
                    },
                ]
+               selector = {
+                   app   = "istio-egressgateway"
+                   istio = "egressgateway"
                }
+               type     = "LoadBalancer"
            }
        }
+       object   = {
+           apiVersion = "v1"
+           kind       = "Service"
+           metadata   = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "istio-egressgateway"
+               namespace                  = "istio-system"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           spec       = {
+               allocateLoadBalancerNodePorts = (known after apply)
+               clusterIP                     = (known after apply)
+               clusterIPs                    = (known after apply)
+               externalIPs                   = (known after apply)
+               externalName                  = (known after apply)
+               externalTrafficPolicy         = (known after apply)
+               healthCheckNodePort           = (known after apply)
+               internalTrafficPolicy         = (known after apply)
+               ipFamilies                    = (known after apply)
+               ipFamilyPolicy                = (known after apply)
+               loadBalancerClass             = (known after apply)
+               loadBalancerIP                = (known after apply)
+               loadBalancerSourceRanges      = (known after apply)
+               ports                         = [
+                   {
+                       appProtocol = (known after apply)
+                       name        = "status-port"
+                       nodePort    = (known after apply)
+                       port        = 15021
+                       protocol    = "TCP"
+                       targetPort  = "15021"
                    },
+                   {
+                       appProtocol = (known after apply)
+                       name        = "http2"
+                       nodePort    = (known after apply)
+                       port        = 80
+                       protocol    = (known after apply)
+                       targetPort  = (known after apply)
                    },
+                   {
+                       appProtocol = (known after apply)
+                       name        = "https"
+                       nodePort    = (known after apply)
+                       port        = 443
+                       protocol    = (known after apply)
+                       targetPort  = (known after apply)
                    },
                ]
+               publishNotReadyAddresses      = (known after apply)
+               selector                      = {
+                   "app"   = "istio-egressgateway"
+                   "istio" = "egressgateway"
                }
+               sessionAffinity               = (known after apply)
+               sessionAffinityConfig         = {
+                   clientIP = {
+                       timeoutSeconds = (known after apply)
                    }
                }
+               type                          = "LoadBalancer"
            }
        }
    }

  # kubernetes_manifest.istioegress-serviceaccount will be created
+   resource "kubernetes_manifest" "istioegress-serviceaccount" {
+       manifest = {
+           apiVersion = "v1"
+           kind       = "ServiceAccount"
+           metadata   = {
+               name      = "istio-egressgateway"
+               namespace = "istio-system"
            }
        }
+       object   = {
+           apiVersion                   = "v1"
+           automountServiceAccountToken = (known after apply)
+           imagePullSecrets             = (known after apply)
+           kind                         = "ServiceAccount"
+           metadata                     = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "istio-egressgateway"
+               namespace                  = "istio-system"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           secrets                      = (known after apply)
        }
    }

  # kubernetes_manifest.istioingress-deployment will be created
+   resource "kubernetes_manifest" "istioingress-deployment" {
+       manifest = {
+           apiVersion = "apps/v1"
+           kind       = "Deployment"
+           metadata   = {
+               name      = "istio-ingressgateway"
+               namespace = "istio-system"
            }
+           spec       = {
+               selector = {
+                   matchLabels = {
+                       app   = "istio-ingressgateway"
+                       istio = "ingressgateway"
                    }
                }
+               template = {
+                   metadata = {
+                       annotations = {
+                           "inject.istio.io/templates" = "gateway"
                        }
+                       labels      = {
+                           app   = "istio-ingressgateway"
+                           istio = "ingressgateway"
                        }
                    }
+                   spec     = {
+                       containers         = [
+                           {
+                               image     = "auto"
+                               name      = "istio-proxy"
+                               resources = {
+                                   limits   = {
+                                       cpu    = "2Gi"
+                                       memory = "1Gi"
                                    }
+                                   requests = {
+                                       cpu    = "100Mi"
+                                       memory = "128Mi"
                                    }
                                }
                            },
                        ]
+                       serviceAccountName = "istio-ingressgateway"
                    }
                }
            }
        }
+       object   = {
+           apiVersion = "apps/v1"
+           kind       = "Deployment"
+           metadata   = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "istio-ingressgateway"
+               namespace                  = "istio-system"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           spec       = {
+               minReadySeconds         = (known after apply)
+               paused                  = (known after apply)
+               progressDeadlineSeconds = (known after apply)
+               replicas                = (known after apply)
+               revisionHistoryLimit    = (known after apply)
+               selector                = {
+                   matchExpressions = (known after apply)
+                   matchLabels      = {
+                       "app"   = "istio-ingressgateway"
+                       "istio" = "ingressgateway"
                    }
                }
+               strategy                = {
+                   rollingUpdate = {
+                       maxSurge       = (known after apply)
+                       maxUnavailable = (known after apply)
                    }
+                   type          = (known after apply)
                }
+               template                = {
+                   metadata = {
+                       annotations                = {
+                           "inject.istio.io/templates" = "gateway"
                        }
+                       clusterName                = (known after apply)
+                       creationTimestamp          = (known after apply)
+                       deletionGracePeriodSeconds = (known after apply)
+                       deletionTimestamp          = (known after apply)
+                       finalizers                 = (known after apply)
+                       generateName               = (known after apply)
+                       generation                 = (known after apply)
+                       labels                     = {
+                           "app"   = "istio-ingressgateway"
+                           "istio" = "ingressgateway"
                        }
+                       managedFields              = (known after apply)
+                       name                       = (known after apply)
+                       namespace                  = (known after apply)
+                       ownerReferences            = (known after apply)
+                       resourceVersion            = (known after apply)
+                       selfLink                   = (known after apply)
+                       uid                        = (known after apply)
                    }
+                   spec     = {
+                       activeDeadlineSeconds         = (known after apply)
+                       affinity                      = {
+                           nodeAffinity    = {
+                               preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
+                               requiredDuringSchedulingIgnoredDuringExecution  = {
+                                   nodeSelectorTerms = (known after apply)
                                }
                            }
+                           podAffinity     = {
+                               preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
+                               requiredDuringSchedulingIgnoredDuringExecution  = (known after apply)
                            }
+                           podAntiAffinity = {
+                               preferredDuringSchedulingIgnoredDuringExecution = (known after apply)
+                               requiredDuringSchedulingIgnoredDuringExecution  = (known after apply)
                            }
                        }
+                       automountServiceAccountToken  = (known after apply)
+                       containers                    = [
+                           {
+                               args                     = (known after apply)
+                               command                  = (known after apply)
+                               env                      = (known after apply)
+                               envFrom                  = (known after apply)
+                               image                    = "auto"
+                               imagePullPolicy          = (known after apply)
+                               lifecycle                = {
+                                   postStart = {
+                                       exec      = {
+                                           command = (known after apply)
                                        }
+                                       httpGet   = {
+                                           host        = (known after apply)
+                                           httpHeaders = (known after apply)
+                                           path        = (known after apply)
+                                           port        = (known after apply)
+                                           scheme      = (known after apply)
                                        }
+                                       tcpSocket = {
+                                           host = (known after apply)
+                                           port = (known after apply)
                                        }
                                    }
+                                   preStop   = {
+                                       exec      = {
+                                           command = (known after apply)
                                        }
+                                       httpGet   = {
+                                           host        = (known after apply)
+                                           httpHeaders = (known after apply)
+                                           path        = (known after apply)
+                                           port        = (known after apply)
+                                           scheme      = (known after apply)
                                        }
+                                       tcpSocket = {
+                                           host = (known after apply)
+                                           port = (known after apply)
                                        }
                                    }
                                }
+                               livenessProbe            = {
+                                   exec                          = {
+                                       command = (known after apply)
                                    }
+                                   failureThreshold              = (known after apply)
+                                   grpc                          = {
+                                       port    = (known after apply)
+                                       service = (known after apply)
                                    }
+                                   httpGet                       = {
+                                       host        = (known after apply)
+                                       httpHeaders = (known after apply)
+                                       path        = (known after apply)
+                                       port        = (known after apply)
+                                       scheme      = (known after apply)
                                    }
+                                   initialDelaySeconds           = (known after apply)
+                                   periodSeconds                 = (known after apply)
+                                   successThreshold              = (known after apply)
+                                   tcpSocket                     = {
+                                       host = (known after apply)
+                                       port = (known after apply)
                                    }
+                                   terminationGracePeriodSeconds = (known after apply)
+                                   timeoutSeconds                = (known after apply)
                                }
+                               name                     = "istio-proxy"
+                               ports                    = (known after apply)
+                               readinessProbe           = {
+                                   exec                          = {
+                                       command = (known after apply)
                                    }
+                                   failureThreshold              = (known after apply)
+                                   grpc                          = {
+                                       port    = (known after apply)
+                                       service = (known after apply)
                                    }
+                                   httpGet                       = {
+                                       host        = (known after apply)
+                                       httpHeaders = (known after apply)
+                                       path        = (known after apply)
+                                       port        = (known after apply)
+                                       scheme      = (known after apply)
                                    }
+                                   initialDelaySeconds           = (known after apply)
+                                   periodSeconds                 = (known after apply)
+                                   successThreshold              = (known after apply)
+                                   tcpSocket                     = {
+                                       host = (known after apply)
+                                       port = (known after apply)
                                    }
+                                   terminationGracePeriodSeconds = (known after apply)
+                                   timeoutSeconds                = (known after apply)
                                }
+                               resources                = {
+                                   limits   = {
+                                       "cpu"    = "2Gi"
+                                       "memory" = "1Gi"
                                    }
+                                   requests = {
+                                       "cpu"    = "100Mi"
+                                       "memory" = "128Mi"
                                    }
                                }
+                               securityContext          = {
+                                   allowPrivilegeEscalation = (known after apply)
+                                   capabilities             = {
+                                       add  = (known after apply)
+                                       drop = (known after apply)
                                    }
+                                   privileged               = (known after apply)
+                                   procMount                = (known after apply)
+                                   readOnlyRootFilesystem   = (known after apply)
+                                   runAsGroup               = (known after apply)
+                                   runAsNonRoot             = (known after apply)
+                                   runAsUser                = (known after apply)
+                                   seLinuxOptions           = {
+                                       level = (known after apply)
+                                       role  = (known after apply)
+                                       type  = (known after apply)
+                                       user  = (known after apply)
                                    }
+                                   seccompProfile           = {
+                                       localhostProfile = (known after apply)
+                                       type             = (known after apply)
                                    }
+                                   windowsOptions           = {
+                                       gmsaCredentialSpec     = (known after apply)
+                                       gmsaCredentialSpecName = (known after apply)
+                                       hostProcess            = (known after apply)
+                                       runAsUserName          = (known after apply)
                                    }
                                }
+                               startupProbe             = {
+                                   exec                          = {
+                                       command = (known after apply)
                                    }
+                                   failureThreshold              = (known after apply)
+                                   grpc                          = {
+                                       port    = (known after apply)
+                                       service = (known after apply)
                                    }
+                                   httpGet                       = {
+                                       host        = (known after apply)
+                                       httpHeaders = (known after apply)
+                                       path        = (known after apply)
+                                       port        = (known after apply)
+                                       scheme      = (known after apply)
                                    }
+                                   initialDelaySeconds           = (known after apply)
+                                   periodSeconds                 = (known after apply)
+                                   successThreshold              = (known after apply)
+                                   tcpSocket                     = {
+                                       host = (known after apply)
+                                       port = (known after apply)
                                    }
+                                   terminationGracePeriodSeconds = (known after apply)
+                                   timeoutSeconds                = (known after apply)
                                }
+                               stdin                    = (known after apply)
+                               stdinOnce                = (known after apply)
+                               terminationMessagePath   = (known after apply)
+                               terminationMessagePolicy = (known after apply)
+                               tty                      = (known after apply)
+                               volumeDevices            = (known after apply)
+                               volumeMounts             = (known after apply)
+                               workingDir               = (known after apply)
                            },
                        ]
+                       dnsConfig                     = {
+                           nameservers = (known after apply)
+                           options     = (known after apply)
+                           searches    = (known after apply)
                        }
+                       dnsPolicy                     = (known after apply)
+                       enableServiceLinks            = (known after apply)
+                       ephemeralContainers           = (known after apply)
+                       hostAliases                   = (known after apply)
+                       hostIPC                       = (known after apply)
+                       hostNetwork                   = (known after apply)
+                       hostPID                       = (known after apply)
+                       hostname                      = (known after apply)
+                       imagePullSecrets              = (known after apply)
+                       initContainers                = (known after apply)
+                       nodeName                      = (known after apply)
+                       nodeSelector                  = (known after apply)
+                       os                            = {
+                           name = (known after apply)
                        }
+                       overhead                      = (known after apply)
+                       preemptionPolicy              = (known after apply)
+                       priority                      = (known after apply)
+                       priorityClassName             = (known after apply)
+                       readinessGates                = (known after apply)
+                       restartPolicy                 = (known after apply)
+                       runtimeClassName              = (known after apply)
+                       schedulerName                 = (known after apply)
+                       securityContext               = {
+                           fsGroup             = (known after apply)
+                           fsGroupChangePolicy = (known after apply)
+                           runAsGroup          = (known after apply)
+                           runAsNonRoot        = (known after apply)
+                           runAsUser           = (known after apply)
+                           seLinuxOptions      = {
+                               level = (known after apply)
+                               role  = (known after apply)
+                               type  = (known after apply)
+                               user  = (known after apply)
                            }
+                           seccompProfile      = {
+                               localhostProfile = (known after apply)
+                               type             = (known after apply)
                            }
+                           supplementalGroups  = (known after apply)
+                           sysctls             = (known after apply)
+                           windowsOptions      = {
+                               gmsaCredentialSpec     = (known after apply)
+                               gmsaCredentialSpecName = (known after apply)
+                               hostProcess            = (known after apply)
+                               runAsUserName          = (known after apply)
                            }
                        }
+                       serviceAccount                = (known after apply)
+                       serviceAccountName            = "istio-ingressgateway"
+                       setHostnameAsFQDN             = (known after apply)
+                       shareProcessNamespace         = (known after apply)
+                       subdomain                     = (known after apply)
+                       terminationGracePeriodSeconds = (known after apply)
+                       tolerations                   = (known after apply)
+                       topologySpreadConstraints     = (known after apply)
+                       volumes                       = (known after apply)
                    }
                }
            }
        }
    }

  # kubernetes_manifest.istioingress-hpa will be created
+   resource "kubernetes_manifest" "istioingress-hpa" {
+       manifest = {
+           apiVersion = "autoscaling/v2beta1"
+           kind       = "HorizontalPodAutoscaler"
+           metadata   = {
+               name      = "istio-ingressgateway"
+               namespace = "istio-system"
            }
+           spec       = {
+               maxReplicas    = 5
+               metrics        = [
+                   {
+                       resource = {
+                           name                     = "cpu"
+                           targetAverageUtilization = 80
                        }
+                       type     = "Resource"
                    },
                ]
+               minReplicas    = 2
+               scaleTargetRef = {
+                   apiVersion = "apps/v1"
+                   kind       = "Deployment"
+                   name       = "istio-ingressgateway"
                }
            }
        }
+       object   = {
+           apiVersion = "autoscaling/v2beta1"
+           kind       = "HorizontalPodAutoscaler"
+           metadata   = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "istio-ingressgateway"
+               namespace                  = "istio-system"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           spec       = {
+               maxReplicas    = 5
+               metrics        = [
+                   {
+                       containerResource = {
+                           container                = (known after apply)
+                           name                     = (known after apply)
+                           targetAverageUtilization = (known after apply)
+                           targetAverageValue       = (known after apply)
                        }
+                       external          = {
+                           metricName         = (known after apply)
+                           metricSelector     = {
+                               matchExpressions = (known after apply)
+                               matchLabels      = (known after apply)
                            }
+                           targetAverageValue = (known after apply)
+                           targetValue        = (known after apply)
                        }
+                       object            = {
+                           averageValue = (known after apply)
+                           metricName   = (known after apply)
+                           selector     = {
+                               matchExpressions = (known after apply)
+                               matchLabels      = (known after apply)
                            }
+                           target       = {
+                               apiVersion = (known after apply)
+                               kind       = (known after apply)
+                               name       = (known after apply)
                            }
+                           targetValue  = (known after apply)
                        }
+                       pods              = {
+                           metricName         = (known after apply)
+                           selector           = {
+                               matchExpressions = (known after apply)
+                               matchLabels      = (known after apply)
                            }
+                           targetAverageValue = (known after apply)
                        }
+                       resource          = {
+                           name                     = "cpu"
+                           targetAverageUtilization = 80
+                           targetAverageValue       = (known after apply)
                        }
+                       type              = "Resource"
                    },
                ]
+               minReplicas    = 2
+               scaleTargetRef = {
+                   apiVersion = "apps/v1"
+                   kind       = "Deployment"
+                   name       = "istio-ingressgateway"
                }
            }
        }
    }

  # kubernetes_manifest.istioingress-rbac-role will be created
+   resource "kubernetes_manifest" "istioingress-rbac-role" {
+       manifest = {
+           apiVersion = "rbac.authorization.k8s.io/v1"
+           kind       = "Role"
+           metadata   = {
+               name      = "istio-ingressgateway"
+               namespace = "istio-system"
            }
+           rules      = [
+               {
+                   apiGroups = [
+                       "",
                    ]
+                   resources = [
+                       "secrets",
                    ]
+                   verbs     = [
+                       "get",
+                       "watch",
+                       "list",
                    ]
                },
            ]
        }
+       object   = {
+           apiVersion = "rbac.authorization.k8s.io/v1"
+           kind       = "Role"
+           metadata   = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "istio-ingressgateway"
+               namespace                  = "istio-system"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           rules      = [
+               {
+                   apiGroups       = [
+                       "",
                    ]
+                   nonResourceURLs = (known after apply)
+                   resourceNames   = (known after apply)
+                   resources       = [
+                       "secrets",
                    ]
+                   verbs           = [
+                       "get",
+                       "watch",
+                       "list",
                    ]
                },
            ]
        }
    }

  # kubernetes_manifest.istioingress-rbac-rolebinding will be created
+   resource "kubernetes_manifest" "istioingress-rbac-rolebinding" {
+       manifest = {
+           apiVersion = "rbac.authorization.k8s.io/v1"
+           kind       = "RoleBinding"
+           metadata   = {
+               name      = "istio-ingressgateway"
+               namespace = "istio-system"
            }
+           roleRef    = {
+               apiGroup = "rbac.authorization.k8s.io"
+               kind     = "Role"
+               name     = "istio-ingressgateway-sds"
            }
+           subjects   = [
+               {
+                   kind = "ServiceAccount"
+                   name = "istio-ingressgateway-service-account"
                },
            ]
        }
+       object   = {
+           apiVersion = "rbac.authorization.k8s.io/v1"
+           kind       = "RoleBinding"
+           metadata   = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "istio-ingressgateway"
+               namespace                  = "istio-system"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           roleRef    = {
+               apiGroup = "rbac.authorization.k8s.io"
+               kind     = "Role"
+               name     = "istio-ingressgateway-sds"
            }
+           subjects   = [
+               {
+                   apiGroup  = (known after apply)
+                   kind      = "ServiceAccount"
+                   name      = "istio-ingressgateway-service-account"
+                   namespace = (known after apply)
                },
            ]
        }
    }

  # kubernetes_manifest.istioingress-service will be created
+   resource "kubernetes_manifest" "istioingress-service" {
+       manifest = {
+           apiVersion = "v1"
+           kind       = "Service"
+           metadata   = {
+               labels    = {
+                   app   = "istio-ingressgateway"
+                   istio = "ingressgateway"
                }
+               name      = "istio-ingressgateway"
+               namespace = "istio-system"
            }
+           spec       = {
+               ports    = [
+                   {
+                       name       = "status-port"
+                       port       = 15021
+                       protocol   = "TCP"
+                       targetPort = 15021
                    },
+                   {
+                       name = "http2"
+                       port = 80
                    },
+                   {
+                       name = "https"
+                       port = 443
                    },
                ]
+               selector = {
+                   app   = "istio-ingressgateway"
+                   istio = "ingressgateway"
                }
+               type     = "LoadBalancer"
            }
        }
+       object   = {
+           apiVersion = "v1"
+           kind       = "Service"
+           metadata   = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "istio-ingressgateway"
+               namespace                  = "istio-system"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           spec       = {
+               allocateLoadBalancerNodePorts = (known after apply)
+               clusterIP                     = (known after apply)
+               clusterIPs                    = (known after apply)
+               externalIPs                   = (known after apply)
+               externalName                  = (known after apply)
+               externalTrafficPolicy         = (known after apply)
+               healthCheckNodePort           = (known after apply)
+               internalTrafficPolicy         = (known after apply)
+               ipFamilies                    = (known after apply)
+               ipFamilyPolicy                = (known after apply)
+               loadBalancerClass             = (known after apply)
+               loadBalancerIP                = (known after apply)
+               loadBalancerSourceRanges      = (known after apply)
+               ports                         = [
+                   {
+                       appProtocol = (known after apply)
+                       name        = "status-port"
+                       nodePort    = (known after apply)
+                       port        = 15021
+                       protocol    = "TCP"
+                       targetPort  = "15021"
                    },
+                   {
+                       appProtocol = (known after apply)
+                       name        = "http2"
+                       nodePort    = (known after apply)
+                       port        = 80
+                       protocol    = (known after apply)
+                       targetPort  = (known after apply)
                    },
+                   {
+                       appProtocol = (known after apply)
+                       name        = "https"
+                       nodePort    = (known after apply)
+                       port        = 443
+                       protocol    = (known after apply)
+                       targetPort  = (known after apply)
                    },
                ]
+               publishNotReadyAddresses      = (known after apply)
+               selector                      = {
+                   "app"   = "istio-ingressgateway"
+                   "istio" = "ingressgateway"
                }
+               sessionAffinity               = (known after apply)
+               sessionAffinityConfig         = {
+                   clientIP = {
+                       timeoutSeconds = (known after apply)
                    }
                }
+               type                          = "LoadBalancer"
            }
        }
    }

  # kubernetes_manifest.istioingress-serviceaccount will be created
+   resource "kubernetes_manifest" "istioingress-serviceaccount" {
+       manifest = {
+           apiVersion = "v1"
+           kind       = "ServiceAccount"
+           metadata   = {
+               name      = "istio-ingressgateway"
+               namespace = "istio-system"
            }
        }
+       object   = {
+           apiVersion                   = "v1"
+           automountServiceAccountToken = (known after apply)
+           imagePullSecrets             = (known after apply)
+           kind                         = "ServiceAccount"
+           metadata                     = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "istio-ingressgateway"
+               namespace                  = "istio-system"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           secrets                      = (known after apply)
        }
    }

Plan: 12 to add, 1 to change, 6 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:terraform workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```


---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
